app/controllers/status_controller.rb

SELECT * FROM `users` LIMIT 1
INSERT INTO `users` (`updated_at`, `nickname`, `url`, `id`, `created_at`) VALUES('2009-01-07 22:25:15', NULL, NULL, 6008237, '2009-01-07 22:25:15')
SELECT * FROM `statuses` WHERE (`statuses`.`facebook_id` = 6008237)
---
	def index
		@facebook_user = session[:facebook_session].user
		@user = User.find_or_initialize_by_id @facebook_user.id
		@user.save if @user.new_record?
    Delayed::Job.enqueue Job::FetchStatuses.new(@user.id)
		@statuses = @user.statuses + Status.all(:conditions => {:user_id => @facebook_user.friends.map(&:id)})

SELECT * FROM `users` WHERE (`users`.`id` = 6008237)
INSERT INTO `statuses` (`message`, `updated_at`, `user_id`, `created_at`) VALUES('--- !map:HashWithIndifferentAccess \nmessage: |\n is afraid to check photos from New Years\r\n\n', '2009-01-07 22:53:50', 6008237, '2009-01-07 22:53:50')
---
	def create
	  user = session[:facebook_session].user
	  @user = User.find user.id
	  @user.statuses.create! :message => params[:status][:message]